import { Box, Grid, Paper, Typography } from "@mui/material";
import React from "react";

const Introducing = () => {
	return (
		<Grid
			item
			xs={12}>
			<Paper
				elevation={0}
				sx={{
					p: { xs: 2, sm: 4 },
					borderRadius: 4,
					border: "1px solid #CCCCCC",
				}}>
				<Typography variant="h6">{"معرفی محصول"}</Typography>
				<Box
					sx={{
						mt: 0.3,
						mb: 1,
						height: 0,
						width: 100,
						border: "1px solid #129F85",
					}}
				/>
				<Typography
					px={2}
					py={1}
					variant="body2"
					textAlign="justify">{`
							لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتاب
							های زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری
							را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد
							، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
							`}</Typography>
			</Paper>
		</Grid>
	);
};

export default Introducing;
